betfair/templates/uk/BFExchangeService.getAccountStatement.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:getAccountStatement>
<ns1:req>
<header>
<sessionToken></sessionToken>
</header>
<endDate>2012-05-16T18:47:04Z</endDate>
<itemsIncluded>ALL</itemsIncluded>
<ignoreAutoTransfers>false</ignoreAutoTransfers>
<recordCount>0</recordCount>
<startDate>2012-05-16T18:47:04Z</startDate>
<startRecord>0</startRecord>
<locale></locale>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:req>
</ns1:getAccountStatement>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
